hw4/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Seba"]]
---
   def similar
       movie = Movie.find(params[:movie_id])
    if  movie.director.nil? || movie.director.length == 0

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "movies" SET "rating" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "PG-13"], ["director", ""], ["updated_at", "2015-11-29 22:27:45.161725"], ["id", 2]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)